{
  "top10": [
    {
      "id": "1",
      "joke": "Why do hippies love corduroy? Because it's groovy man."
    },
    {
      "id": "2",
      "joke": "I used to hate facial hair, but it grew on me."
    },
    {
      "id": "3",
      "joke": "What do you call a bundle of hay in a church? Christian Bale."
    },
    {
      "id": "4",
      "joke": "I'm afraid for the calendar. Its days are numbered."
    },
    {
      "id": "5",
      "joke": "*With a pirate voice* Wha'ts a pirates favorite letter? R? RRRRR One might think, however, it would actually be the C!"
    },
    {
      "id": "6",
      "joke": "Have you ever tried to make a belt out of wrist watches? It's a waist of time."
    },
    {
      "id": "7",
      "joke": "A pony with a cough is just a little horse."
    },
    {
      "id": "8",
      "joke": "My wife said I should do lunges to stay in shape. That would be a big step forward."
    },
    {
      "id": "9",
      "joke": "Why did the bicycle fall over? It was two tired."
    },
    {
      "id": "10",
      "joke": "How do you fix a broken pizza? With tomato paste."
    }
  ],
  "favorites": [
    {
      "joke": "I just wrote a book on reverse psychology. Do not read it!",
      "likes": 6,
      "id": 10
    },
    {
      "joke": "Why did Mozart kill all his chickens?\nBecause when he asked them who the best composer was, they'd all say \"Bach bach bach!\"\n",
      "likes": 7,
      "id": 11
    },
    {
      "joke": "Conjunctivitis.com – now that’s a site for sore eyes.",
      "likes": 3,
      "id": 12
    },
    {
      "joke": "I decided to sell my Hoover… well it was just collecting dust.",
      "likes": 2,
      "id": 13
    },
    {
      "joke": "I decided to sell my Hoover… well it was just collecting dust.",
      "likes": 0,
      "id": 14
    },
    {
      "joke": "What was the pumpkin’s favorite sport?\n\nSquash.",
      "likes": 0,
      "id": 15
    },
    {
      "joke": "The first time I got a universal remote control I thought to myself, \"This changes everything\"",
      "likes": 1,
      "id": 16
    },
    {
      "joke": "What did the doctor say to the gingerbread man who broke his leg? Try icing it.",
      "likes": 130,
      "id": 17
    }
  ]
}